CF/InformationRegisters/ГрафикиРаботыМагазинов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыМагазинов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидГрафикаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ВидыГрафиковРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыГрафиковРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пятидневка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шестидневка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерабочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/Магазины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Магазины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМинимальныхЦенПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриПеремещении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриПоступлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрименениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</Name>
					<Comment>Порядок округления суммы чека в пользу покупателя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментИсключаемойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматМагазина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыМагазинов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладУправляющейСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрямуюИнкассацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьАссортимент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьАссортиментВЗаказеПокупателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРасчетаПотребности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРасчетаПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОкругленияЧекаВПользуПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьТорговогоЗала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/InformationRegisters/ГрафикиРаботыМагазинов/Forms/ФормаНабораЗаписей/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеВопросПриИзмененииВидаГрафика(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПроверкаУспешна = ПроверитьЗаполнение();
		
		Если ПроверкаУспешна Тогда
			ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере();
			Модифицированность = Истина;
		Иначе
			ВидГрафикаРаботы = ПредыдущийВидГрафикаРаботы;
		КонецЕсли;
		
	Иначе
		ВидГрафикаРаботы = ПредыдущийВидГрафикаРаботы;
	КонецЕсли;
	
	Элементы.Календарь.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПечатьГрафикаРаботыМагазина(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗаписатьКалендарныйГрафик(ОтборМагазин, НомерТекущегоГода);
		Оповестить("ГрафикРаботыИзменен");
		Модифицированность = Ложь;
		ЗавершитьПечатьГрафикаРаботыМагазина();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПриИзмененииМагазина(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПроверкаУспешна = ПроверитьЗаполнение();
		
		Если ПроверкаУспешна Тогда
			ЗаписатьКалендарныйГрафик(ПредыдущийМагазин, НомерТекущегоГода);
			Оповестить("ГрафикРаботыИзменен");
			ЗавершитьСчитываниеДанныхГрафика();
		Иначе
			ОтборМагазин = ПредыдущийМагазин;
		КонецЕсли;
	Иначе
		ОтборМагазин = ПредыдущийМагазин;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросПриИзмененииГода(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьКалендарныйГрафик(ОтборМагазин, НомерПредыдущегоГода);
		Оповестить("ГрафикРаботыИзменен");
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
	ЗавершитьСчитываниеДанныхГрафика();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВыборИзМенюВидаДня(Выбор, ДополнительныеПараметры) Экспорт
	Если НЕ Выбор = Неопределено Тогда
		
		Отбор = Новый Структура("ДатаКалендаря", ДополнительныеПараметры.ВыбраннаяДата);
		
		МассивСтрокТаблицыРегистра = ТаблицаРегистра.НайтиСтроки(Отбор);
		Если МассивСтрокТаблицыРегистра.Количество() > 0 Тогда
			МассивСтрокТаблицыРегистра[0].ВидДня = Выбор.Значение;
			
			Если Не Модифицированность Тогда
				Модифицированность = Истина;
			КонецЕсли;
			
			ДополнительныеПараметры.Элемент.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Магазин") Тогда
		
		ОтборМагазин = Параметры.Отбор.Магазин;
		Элементы.ОтборМагазин.Доступность = Ложь;
		
	КонецЕсли;	
	
	Если Параметры.Отбор.Свойство("Год") Тогда
		
		НомерТекущегоГода = Параметры.Отбор.Год;
		
	Иначе
		
		НомерТекущегоГода = Год(ТекущаяДатаСеанса());
		
	КонецЕсли;	
		
	НомерПредыдущегоГода	   = НомерТекущегоГода;
	ПредыдущийМагазин          = ОтборМагазин;
	ПредыдущийВидГрафикаРаботы = ВидГрафикаРаботы;
	
	Элементы.Календарь.НачалоПериодаОтображения	= Дата(НомерТекущегоГода, 1, 1);
	Элементы.Календарь.КонецПериодаОтображения	= Дата(НомерТекущегоГода, 12, 31);
	
	ТаблицаРегистра.Загрузить(РегистрыСведений.ГрафикиРаботыМагазинов.ГрафикРаботыМагазина(ОтборМагазин,НомерТекущегоГода));
		
	Если ТаблицаРегистра.Количество() = 0 Тогда
		
		ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Пятидневка;
		ПредыдущийВидГрафикаРаботы = ВидГрафикаРаботы;
		ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере();
		Модифицированность = Истина;
		
	Иначе
		
		ВидГрафикаРаботы = ТаблицаРегистра[0].ВидГрафикаРаботы;
		ПредыдущийВидГрафикаРаботы = ВидГрафикаРаботы;
		
	КонецЕсли;
	
	ЦветаДней = Новый Структура();
	ЦветаДней.Вставить("ЦветРабочегоДня",        Новый Цвет(  0,  0,   0)); // Черный
	ЦветаДней.Вставить("ЦветСубботы",            Новый Цвет(153, 51,   0)); // Темно-красный
	ЦветаДней.Вставить("ЦветВоскресенья",        Новый Цвет(255,  0,   0)); // Красный
	ЦветаДней.Вставить("ЦветПредпраздничногоДня", Новый Цвет(  0,  0, 186)); // Темно-синий
	ЦветаДней.Вставить("ЦветПраздничногоДня",    Новый Цвет(255,  0, 255)); // Фиолетовый
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Перем НомерГода;
	
	Если Не ПараметрыЗаписи.Свойство("НомерГода", НомерГода) Тогда
		НомерГода = НомерТекущегоГода;
	КонецЕсли;
	
	ЗаписатьКалендарныйГрафик(ОтборМагазин, НомерГода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ГрафикРаботыИзменен");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерТекущегоГодаПриИзменении(Элемент)
	
	Если НомерТекущегоГода < 1900 Тогда
		НомерТекущегоГода = НомерПредыдущегоГода;
		Возврат;
	КонецЕсли;
	
	ПроверкаУспешна = ПроверитьЗаполнение();
	
	Если ПроверкаУспешна Тогда
			
		Если Модифицированность Тогда
			
			ТекстВопроса = НСтр("ru = 'Записать измененные данные за %1 год?'");
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, Формат(НомерПредыдущегоГода, "ЧГ=0"));
			
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПриИзмененииГода", ЭтотОбъект);
			ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Иначе
			ЗавершитьСчитываниеДанныхГрафика();
		КонецЕсли;
	Иначе
		НомерТекущегоГода = НомерПредыдущегоГода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	
	Для каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл
		
		СтруктураОтбора = Новый Структура("ДатаКалендаря",СтрокаОформленияПериода.Дата);
		
		Если НомерТекущегоГода = Год(СтрокаОформленияПериода.Дата) Тогда
			
			СтрокаТаблицыРегистра = ТаблицаРегистра[ДеньГода(СтрокаОформленияПериода.Дата)-1];
			
			ЗначениеСравнения = СтрокаТаблицыРегистра.ВидДня;
			
			Если ЗначениеСравнения = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий") Тогда
				
				СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветРабочегоДня;
				
			ИначеЕсли ЗначениеСравнения = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный") Тогда
				
				СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветПредпраздничногоДня;
				
			ИначеЕсли ЗначениеСравнения = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник") Тогда
				
				СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветПраздничногоДня;
				
			ИначеЕсли ЗначениеСравнения = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота") Тогда
				
				Если СтрокаТаблицыРегистра.ВидГрафикаРаботы = ПредопределенноеЗначение("Перечисление.ВидыГрафиковРаботы.Пятидневка") Тогда
					
					СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветСубботы;
					
				Иначе
					
					СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветРабочегоДня;
					
				КонецЕсли;
				
			ИначеЕсли ЗначениеСравнения = ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье") Тогда
				
				Если Не СтрокаТаблицыРегистра.ВидГрафикаРаботы = ПредопределенноеЗначение("Перечисление.ВидыГрафиковРаботы.Полный") Тогда
					
					СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветВоскресенья;
					
				Иначе
					
					СтрокаОформленияПериода.ЦветТекста = ЦветаДней.ЦветРабочегоДня;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьВыбор(Элемент, ВыбраннаяДата)
	
	СписокВидыДней = Новый СписокЗначений;
	
	СписокВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Воскресенье"));
	СписокВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Праздник"));
	СписокВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный"));
	СписокВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий"));
	СписокВидыДней.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота"));
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяДата", ВыбраннаяДата);
	ДополнительныеПараметры.Вставить("Элемент"      , Элемент);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВыборИзМенюВидаДня", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзМеню(ОбработчикОповещения, СписокВидыДней, Элементы.Календарь);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМагазинПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ОтборМагазин) Тогда
		ОтборМагазин = ПредыдущийМагазин;
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПредыдущийМагазин) Тогда
		
		ТекстВопроса = НСтр("ru = 'Очистить измененные данные за %1 год?'");
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, Формат(НомерТекущегоГода, "ЧГ=0"));
		
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПриИзмененииМагазина", ЭтотОбъект);
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПроверкаУспешна = ПроверитьЗаполнение();
		Если ПроверкаУспешна Тогда
			ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере();
			ПредыдущийМагазин = ОтборМагазин;
			Элементы.ОтборМагазин.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидГрафикаРаботыОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидГрафикаПриИзменении(Элемент)
	
	ТекстВопроса = НСтр("ru = 'Заполнить данные по умолчанию для графика ""%1""?'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ВидГрафикаРаботы);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПриИзмененииВидаГрафика", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НапечататьГрафикРаботыМагазина(Команда)
	
	ПроверкаУспешна = ПроверитьЗаполнение();
	
	Если ПроверкаУспешна Тогда
		
		Если Модифицированность Тогда
			
			ТекстВопроса = НСтр("ru = 'Печать графика работы возможна только после его записи, записать график работы?'");
			
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросПечатьГрафикаРаботыМагазина", ЭтотОбъект);
			ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ЗавершитьПечатьГрафикаРаботыМагазина();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчанию()
	
	Если ВидГрафикаРаботы.Пустая() Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Вид графика"" не заполнено'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"ВидГрафикаРаботы",,);
		
	Иначе
		
		ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере();
		
		Элементы.Календарь.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере()
	
	ТаблицаРегистра.Очистить();
	
	ПраздничныеДни = ПерсоналВызовСервера.МассивПраздничныхДней(НомерТекущегоГода);
	
	ПроверитьПоследнийДеньГода = Ложь;
	
	Для НомерДня = 1 По ДеньГода(КонецГода(Дата(НомерТекущегоГода, 1, 1))) Цикл
		
		СтрокаТаблицыРегистра = ТаблицаРегистра.Добавить();
		
		ДатаКалендаря = НачалоГода(Дата(НомерТекущегоГода,1,1)) + (НомерДня-1) * 86400;
		
		СтрокаТаблицыРегистра.ДатаКалендаря    = ДатаКалендаря;
		СтрокаТаблицыРегистра.ВидГрафикаРаботы = ВидГрафикаРаботы;
		
		Если ПраздничныеДни.Найти(ДатаКалендаря) <> Неопределено Тогда
			
			СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник;
			
			Если СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
				
				Если НомерДня > 1 Тогда
					
					ТаблицаРегистра[НомерДня-1].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный;
					
				Иначе
					
					ПроверитьПоследнийДеньГода = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Пятидневка Тогда
				Если ДеньНедели(ДатаКалендаря) = 6 Тогда
					
					СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота;
					
				ИначеЕсли ДеньНедели(ДатаКалендаря) = 7 Тогда
					
					СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье;
					
				Иначе
					
					СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
					
				КонецЕсли;
			ИначеЕсли ВидГрафикаРаботы = Перечисления.ВидыГрафиковРаботы.Шестидневка Тогда
				Если ДеньНедели(ДатаКалендаря) = 7 Тогда
					
					СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье;
					
				Иначе
					
					СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
					
				КонецЕсли;
			Иначе
				СтрокаТаблицыРегистра.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	Если ПроверитьПоследнийДеньГода Тогда
		
		Если ТаблицаРегистра[0].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда
			
			Индекс = ТаблицаРегистра.Количество()-1;
			ТаблицаРегистра[Индекс].ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьКалендарныйГрафик(Магазин, НомерГода)
	
	ТаблицаИзРегистра = РегистрыСведений.ГрафикиРаботыМагазинов.ГрафикРаботыМагазина(Магазин, НомерГода);
	
	Если ТаблицаИзРегистра.Количество() = 0 Тогда
		
		ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере();
		
	Иначе 
		
		ВидГрафикаРаботы = ТаблицаРегистра[0].ВидГрафикаРаботы;
		
	КонецЕсли;
	
	Возврат ТаблицаИзРегистра;
	
КонецФункции

&НаСервере
Процедура ЗаписатьКалендарныйГрафик(Знач Магазин, Знач НомерГода)
	
	Если ПроверитьЗаполнение() Тогда
		
		РегистрыСведений.ГрафикиРаботыМагазинов.ЗаписатьДанныеГрафикаВРегистр(Магазин, НомерГода, ТаблицаРегистра);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьГрафикРаботыМагазинаВТаблицуНаСервере()
	
	ТаблицаРегистра.Загрузить(ПрочитатьКалендарныйГрафик(ОтборМагазин, НомерТекущегоГода));
	
	Если ТаблицаРегистра.Количество() = 0 Тогда
		
		ЗаполнитьГрафикРаботыМагазинаДаннымиПоУмолчаниюНаСервере();
		Модифицированность = Истина;
		
	Иначе
		
		ВидГрафикаРаботы = ТаблицаРегистра[0].ВидГрафикаРаботы;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПечатьГрафикаРаботыМагазина()
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Магазин", ОтборМагазин);
	СтруктураОбъекта.Вставить("Год", НомерТекущегоГода);
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ОтборМагазин);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Справочник.Магазины",
		"ГрафикРаботы",
		ПараметрКоманды,
		ЭтаФорма,
		СтруктураОбъекта);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСчитываниеДанныхГрафика()
	
	НомерПредыдущегоГода = НомерТекущегоГода;
	ПредыдущийМагазин    = ОтборМагазин;
	
	Элементы.Календарь.НачалоПериодаОтображения	= Дата(НомерТекущегоГода, 1, 1);
	Элементы.Календарь.КонецПериодаОтображения	= Дата(НомерТекущегоГода, 12, 31);
	
	ЗагрузитьГрафикРаботыМагазинаВТаблицуНаСервере();
	
	Элементы.Календарь.Обновить();
	
КонецПроцедуры

#КонецОбласти
